fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>BKM_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ДополнениеРеализацияТоваровИУслугСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция проверяет наличие сущиствующего докумета с данными предлагаемые к записи
// Параметры:
// ТекущийОбъект - ДокументОбъект
// Возвращаемое значение:
// 	ДокументСсылка 
// 	Неопределено
Функция НайтиСуществующийДокументРеализацияСДаннымиТекущегоОбъекта(ТекущийОбъект) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка.Дата >= &ДатаНачалаПериода
		|	И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &ДатаОкончанияПериода
		|	И РеализацияТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|				BKM_НоменклатураАбонентскаяПлата.Значение КАК Номенклатура
		|			ИЗ
		|				Константа.BKM_НоменклатураАбонентскаяПлата КАК BKM_НоменклатураАбонентскаяПлата
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				BKM_НоменклатураРаботыСпециалиста.Значение
		|			ИЗ
		|				Константа.BKM_НоменклатураРаботыСпециалиста КАК BKM_НоменклатураРаботыСпециалиста)
		|	И РеализацияТоваровУслугУслуги.Ссылка.Договор = &Договор
		|	И РеализацияТоваровУслугУслуги.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
		|	И РеализацияТоваровУслугУслуги.Ссылка.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание)
		|	И РеализацияТоваровУслугУслуги.Ссылка.Контрагент = &Контрагент
		|	И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("Договор", ТекущийОбъект.Договор); 
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
    Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
   	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе 
		
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции

// Проверка правильности заполнения документа РеализацияТоваровУслуг
// Параметры:
// 	 Объект - ДокументОбъект
// Возвращаемое значение:
// 	Булево
Функция ДокументРеализацииТоваровИУслугЗаполненВерно(Знач Объект) Экспорт
	
	Если  Не ЗначениеЗаполнено(Объект.Договор) Тогда	
		
		ТекстСообщения = "Ошибка. Не указан договор";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"Объект.Договор","Объект.Договор");
		Возврат Ложь;

	КонецЕсли; 
	
	//@skip-check wrong-string-literal-content
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ВидДоговора") <> Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание Тогда
		
		ТекстСообщения = "Должен быть договор абонентского обслуживания";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Договор");
		Возврат Ложь;
		
	КонецЕсли;  
		
	// Проверяем действие договора
	ДатаНачалИДатаОкончанияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,"BKM_ДатаНачалаДействияДоговора,BKM_ДатаОкончанияДействияДоговора");
	Если ДатаНачалИДатаОкончанияДоговора.BKM_ДатаНачалаДействияДоговора > Объект.Дата 
		Или   ДатаНачалИДатаОкончанияДоговора.BKM_ДатаОкончанияДействияДоговора < Объект.Дата Тогда
					
		ТекстСообщения = "Выбранный договор не дейстителен на дату документа.
						|Создание документа реализации товаров и услуг невозможно. ";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Договор");
		Возврат Ложь;		 
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
